# Создать строку равную предпоследнему символу введенной строки

string = list(input('Введите строку: '))
last_str = string.pop()
print('Строка => ', last_str)