# Создать строку равную третьему символу введенной строки.
string = input('Введите строку: ')
third_str = str(string[2])
print('Строка => ', third_str)