# Создать строку равную введенной строку без последних двух символов

string = input('Введите строку: ')
two_str = str(string[:-2])
print('Строка => ', two_str)