# Создать строку равную первым пяти символам введенной строки

string = input('Введите строку: ')
five_str = str(string[:5])
print('Строка => ', five_str)