'''
Задания:
1) Создать матрицу случайных чисел от a до b, размерность матрицы n*m
2) Найти максимальный элемент матрицы.
3) Найти минимальный минимальный матрицы.
4) Найти сумму всех элементов матрицы.
5) Найти индекс ряда с максимальной суммой элементов.
6) Найти индекс колонки с максимальной суммой элементов.
7) Найти индекс ряда с минимальной суммой элементов.
8) Найти индекс колонки с минимальной суммой элементов.
9) Обнулить все элементы выше главной диагонали.
10) Обнулить все элементы ниже главной диагонали.
11) Создать две новые матрицы matrix_a, matrix_b случайных чисел размерностью n*m.
12)Создать матрицу равную сумме matrix_a и matrix_b.
13)Создать матрицу равную разности matrix_a и matrix_b.
14)Создать новую матрицу равную matrix_a умноженной на g. g вводится с клавиатура

Пример:

4 3 6 1 8 2 9 5 3

2) максимальный элемент - 9
3) Минимальный элемент - 1
4) Сумма - 41
5) Индекс максимального ряда - 2 (9+5+3)
6) Индекс минимальной колонки  - 1 (3+8+5)
7) Индекс минимального ряда - 1 (1+8+2)
8) Индекс минимальной колонки - 2 (6+2+3)
9) 4 0 0 1 8 0 9 5 3
10) 4 0 0  0 8 0  0 0 3


К ознакомлению:
https://git-scm.com/book/ru/v1/%D0%92%D0%B2%D0%B5%D0%B4%D0%B5%D0%B D%D0%B8%D0%B5

https://proglib.io/p/git-for-half-an-hour/
'''