# Даны катеты прямоугольного треугольника. Найти его гипотенузу и площадь
import math
a = int(input('Введите катет 1: '))
b = int(input('Введите катет 2: '))
C = math.sqrt(pow(a,2)+pow(b,2))
S = (a*b)/2

print( 'Гипотенуза: ' + str(C) , 'Площадь: ' + str(S))
