# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение

a = int(input('Введите число a: '))
b = int(input('Введите число b: '))
summa = a + b
raznost = a - b
proizvedenie = a * b
print('Сумма: ' + str(summa) + ', Разность: ' + str(raznost) + ', Произведение: ' + str(proizvedenie))
