# Даны действительные числа x и y. Получить (x-y)/(1+(x*y))
x = int(input('Введите число x: '))
y = int(input('Введите число y: '))
rez = (x-y)/(1+(x*y))
print('(x-y)/(1+(x*y)) = ' + str(rez))
