# Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности
L = int(input('Введите длину ребра куба: '))
V = L**3
print('Объем куба: ' + str(V))
S = L**2
print('Площадь его боковой поверхности: ' + str(S))
